<template>
  <div>
    <a-page-header @back="() => this.$router.push('latest-news')">
      <span slot="title" style="font-weight: normal">最新消息</span>
    </a-page-header>
    <div class="news_header"></div>
    <div class="content_box">
      <div class="xuxian"></div>
      <h1 style="text-align: center">2019中科院ACME博弈算法挑战赛通知</h1>
      <div style="text-align: center">来源： 责任编辑： 日期：2019-09-10
      </div>
      <div class="xuxian"></div>
      <div class="content_title">赛事简介</div>
      <p>AlphaGo机器人战胜了人类顶尖围棋选手，擅长聊天的机器人可以成为你的朋友，人工智能离我们越来越近，强大的人工智能算法在进行着认知、学习和预测，为我们提供医疗、法律、金融等方面的建议和决策。青少年编程博弈算法挑战赛正是利用python编程语言来实现博弈算法，作为博弈者可以最大程度利用游戏的规则开发出最佳的算法策略；通过比赛，参赛者用python语言编程来解决人工智能问题，提升自己，训练逻辑思维能力。</p>
      <p>在人工智能的时代，Python语言变得日益流行。对于Python数据科学，顾名思义，就是通过Python进行数据的处理与分析。Python数据科学是从事AI所必须的技能，因此学习Python数据科学是非常有必要的。人工智能在过去几年发展迅速。面向人工智能的开发一方面是使用Python与人工智能开源框架进行快速开发，另一方面是利用各个主要云计算提供商发布的人工智能服务，通过面向开发者人工智能API快速搭建实用的人工智能应用。</p>
      <p>博弈算法编程挑战赛，以Python语言为基础，对涉及到的机器学习中的分类、回归和聚类等的相关算法与实例用到的机器学习库在开源数据上进行算法测试和调节相关参数，以有趣的效果体会人工智能的魅力。</p>
      <div class="content_title">赛项介绍</div>
      <h3>小学组——贪吃蛇游戏</h3>
      <p>赛项说明：“贪吃蛇游戏”比赛为贪吃蛇吃果子，每回合都将调用玩家上传的编程代码，做出决策控制贪吃蛇进行运动，寻找出现的果子，贪吃蛇移动方向由编程代码控制。 此赛项游戏主界面为30*30的网格，贪吃蛇从网格的左上角出发，寻找随机出现的果子。当贪吃蛇吃掉一个果子后，网格中会接着再出现一个果子，贪吃蛇身体长度随之加2，依次循环。 蛇头与果子位置重合则判定为吃掉果子，果子不会出现在蛇身体上，贪吃蛇可以穿墙，蛇头碰撞自己蛇的身体(即序列重复)判定为死亡。 果子随机出现是有规则的，每次果子距离蛇头的位置都是定长的，即从蛇头到每个果子的曼哈顿距离（不穿越边界条件下）的总和相同。</p>
      <p>评分标准:每次比赛会出现规定个数的果子，吃完所有果子或蛇死亡，则比赛停止，全部任务完成的参赛选手以贪吃蛇所走步长进行排名，步长最短者获胜。 注意：当贪吃蛇未完成吃果子任务就死亡时，则按照吃果子由多到少进行排名，吃果子多的排名靠前；相同果子数，所用步数越少，得分越高。</p>
      <h3>初高中组——贪吃蛇博弈算法对抗</h3>
      <p>赛项说明:贪吃蛇博弈算法对抗为双人（或两组）对战，每回合都将调用玩家上传的博弈编程代码，做出决策控制贪吃蛇进行运动。此赛项将python人工智能中的算法思想与传统的贪吃蛇游戏相结合，在提高学生兴趣的情况下完成对当下最流行的人工智能的基本思想的初步认知。 参赛者在30*30的网格中通过事先编写好的程序操纵各自的贪吃蛇，参赛者只能控制蛇头的朝向(上、下、左、右)来控制蛇的下一步移动的方向。蛇的初始位置固定，并以恒定速度前进；蛇会自动长大，前10回合每回合长度增加1，从第11回合开始，每2回合长度增加1。 可以参考阿尔法狗的思想，通过python人工智能的思想尽可能去从总体上去考虑，不仅仅需要进行前向预测来寻找空间最大的可能走法。还要尽可能去预测比赛对象的可能前进路径去做出相应的堵截。 比赛中不仅可以直接去考虑到战胜对方，也可以去考虑怎么让自己尽可能的存活更长的时间，从侧面取得胜利。</p>
      <p>胜负评价:蛇头在网格外、障碍物、自己蛇的身体(即序列重复)、对方蛇的身体(即与对方序列有相同坐标)，或非法操作均判定为死亡。任何一条蛇死亡时，游戏结束。若蛇同时死亡，判定为平局，否则先死的一方输，另一方赢。</p>
      <p style="font-weight: bold">核心算法答辩评分标准（共计40分）</p>
      <p>1.算法创新性 分数：16分 创新性算法>对经典算法进行改进>编码实现经典算法>直接调用</p>
      <p>2.答辩表现 分数：12分 评委根据竞赛队伍现场答辩的表现给出综合评分；</p>
      <p>3.代码能力 分数：12分 评委从编码规范、代码结构、代码注释、代码复用、封装、抽象等方面进行评价。</p>
      <p>总得分为：循环赛得分与答辩评分两部分之和。积分相同者再加赛一次。</p>
      <div class="content_title">竞赛规则</div>
      <h3>小学组---贪吃蛇游戏</h3>
      <p>小学组正式比赛为每小组（或个人）完成赛项设置的任务。</p>
      <p>小学组正式比赛评分标准：</p>
      <p>评分指标有吃到果子数量与行进步数，优先比较吃到果子数量，数量相同时比较行进步数</p>
      <p>①首先按照吃到的果子数量排名，吃到的果子越多，排名越高；</p>
      <p>②吃到相同果子数量的选手按照行进步数排名，行进步数越少，排名越高</p>
      <p>③最终成绩为：每个小组比6轮，去掉一个最高分、一个最低分，剩下4轮取平均值为最终成绩。</p>
      <p>禁止事项：禁止带入与比赛相关的资料</p>
      <h3>中学组---贪吃蛇博弈算法对抗</h3>
      <p>初高中组比赛分为正式比赛、答辩。</p>
      <p>正式比赛：采用循环赛制，积分制；</p>
      <p>答辩：核心代码现场答辩评分（可以ppt展示，也可以直接展示代码）</p>
      <p>核心代码答辩:总时间10分钟，汇报5分钟+专家提问5分钟</p>
      <p>循环赛采用5局3胜制，每胜一局积10分；</p>
      <p>禁止事项：禁止带入与比赛相关的资料</p>
      <div class="content_title">竞赛纪律</div>
      <h3>小学组---贪吃蛇游戏</h3>
      <p>①每组选手提交自己的程序编程代码；</p>
      <p>②参加比赛的每组选手在相同标准下进行比赛，并完成赛项规定任务；</p>
      <p>③按照小学组赛项评价标准，进行排名。</p>
      <p>禁止事项：禁止带入与比赛相关的资料</p>
      <p>比赛检录时间：2019/11/03 8:00-9:00</p>
      <p>竞赛时间：2019/11/03 9:00-12:00</p>
      <h3>中学组---贪吃蛇博弈算法对抗</h3>
      <p>比赛总流程：正式比赛循环赛 > 答辩</p>
      <p>①每组选手提交自己的算法博弈代码；</p>
      <p>②进行比赛的两组选手的代码在屏幕上对抗演示，采取5局3胜制确定胜利方，胜利方获得10分；</p>
      <p>③决赛小组选手进行答辩评分。</p>
      <p>禁止事项：禁止带入与比赛相关的资料</p>
      <p>比赛检录时间：2019/11/03 8:00-9:00</p>
      <p>竞赛时间：2019/11/03 9:00-12:00</p>
      <div class="content_title">比赛准备及流程</div>
      <h3>参赛选手准备</h3>
      <p>①笔记本电脑一台： 操作系统：windows7，8或10 i5以上配置、安装python3.5.1、pycharm编译器</p>
      <p>②U盘：2GB以上</p>
      <p>③纸+笔</p>
      <h3>小学组---贪吃蛇游戏比赛流程</h3>
      <p>①裁判宣读比赛要求</p>
      <p>②各小组向裁判领取比赛代码</p>
      <p>③比赛时间：90分钟</p>
      <p>④各小组向裁判提交比赛代码</p>
      <p>⑤进行正式比赛</p>
      <p>⑥公布正式比赛积分结果</p>

      <h3>中学组---贪吃蛇博弈算法对抗比赛流程</h3>
      <p>①裁判宣读比赛规则</p>
      <p>②各小组向裁判领取比赛代码</p>
      <p>③比赛时间：90分钟</p>
      <p>④各小组向裁判提交比赛代码</p>
      <p>⑤进行循环赛，并公布循环赛积分结果</p>
      <p>⑥代码展示答辩，评委打分</p>
      <p>附件：<a @click="attachmentOne">2019博弈算法挑战赛程序手册</a></p>
    </div>
  </div>
</template>

<script>
export default {
  name: "newsThree",
  methods:{
    attachmentOne(){
      location.href = "http://58.119.112.12/CCZX_image/shouce.doc";
    }
  }
};
</script>

<style scoped>
p {
  text-indent: 2rem;
}
a:hover {
  color: #023aa4;
  border-bottom: 1px solid #2a487a;
}
.news_header{
  width: 100%;
  height: 200px;
  background-image: url("../../../assets/newsBg.jpg");
  background-size: 100%;
}
.xuxian{
  height: 10px;
  margin-top: 10px;
  border-top: 0.01rem dashed #ccc;
}
.content_box{
}
.content_title{
  font-size: 20px;
  font-weight: bold;
  margin-bottom: 5px;
}

</style>


